Revit 2015 API
View.ViewTemplateId Property
 Id of template that controls view parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
public ElementId ViewTemplateId { get; set; }
Visual Basic
Public Property ViewTemplateId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ViewTemplateId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Parameters controlled by the template cannot be changed directly in this view. Any change to controlled parameters in the template will cause change of the corresponding parameters in this view. To get all template parameters call template's method getTemplateParameterIds. To get parameters that are not controlled by the template call template's method getNonControlledTemplateParameterIds.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: val is not valid as view template id.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
View Class
Autodesk.Revit.DB Namespace